# 20.	문자열 형식으로 입력받은 모스 부호(dot: . dash:-)를 해독하여 영어 문장으로 출력하는 프로그램을 작성해 보자. (딕셔너리 이용)

sign = {'.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E','..-.':'F','--.':'G','....':'H','..':'I','.---':'J','-.-':'K','.-..':'L','--':'M','-.':'N','---':'O','.--.':'P','--.-':'Q','.-.':'R','...':'S','-':'T','..-':'U','...-':'V','.--':'W','-..-':'X','-.--':'Y','--..':'Z'}
text = ".... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--"
char = text.split(' ')

for i in char:
    if i == '':
        print(' ', end="")
    else :
        print(sign[i], end="")